---
kind: method
id: M:Autodesk.Revit.DB.Electrical.VoltageTypeSetIterator.#ctor
source: html/7d247b9a-accd-8192-ecd7-1d11e72f637d.htm
---
# Autodesk.Revit.DB.Electrical.VoltageTypeSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public VoltageTypeSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.